Австралия/src/Catalogs/SuppliersProducts/SuppliersProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SuppliersProducts</name>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </attributes>
  <attributes>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>EnumRef.ProductsTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/SuppliersProducts/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED TOP 1
	|	SuppliersProducts.Ref
	|FROM
	|	Catalog.SuppliersProducts AS SuppliersProducts
	|WHERE
	|	SuppliersProducts.Owner = &Owner
	|	AND SuppliersProducts.SKU = &SKU
	|	AND SuppliersProducts.Products = &Products
	|	AND SuppliersProducts.Characteristic = &Characteristic
	|	AND SuppliersProducts.Ref <> &CurrentRef";
	
	Query.SetParameter("Owner", Owner);
	Query.SetParameter("SKU", SKU);
	Query.SetParameter("Products", Products);
	Query.SetParameter("Characteristic", Characteristic);
	Query.SetParameter("CurrentRef", Ref);
	
	Result = Query.Execute();
	If Not Result.IsEmpty() Then
		
		MessageText = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Product cross-reference ""%1,%2 - %3,%4"" already exists.'; ru = 'Номенклатура поставщиков ""%1,%2 - %3,%4"" уже существует.';pl = 'Powiązane informacje o produkcie ""%1,%2 - %3,%4"" już istnieją.';es_ES = 'El Producto con referencias cruzadas %1,%2 - %3,%4 ya existe.';es_CO = 'El Producto con referencias cruzadas %1,%2 - %3,%4 ya existe.';tr = '""%1,%2 - %3,%4"" ürün çapraz referansı zaten mevcut.';it = 'Il riferimento incrociato dell''articolo ""%1,%2 - %3, %4"" esiste già.';de = 'Die Produktherstellartikelnummer ""%1,%2 - %3,%4"" ist bereits vorhanden.'"),
			Owner, SKU, Products, Characteristic);
			
		CommonClientServer.MessageToUser(MessageText,,,,Cancel);
		
	EndIf;
	
	EnumProductsType = Common.ObjectAttributeValue(Products, "ProductsType");
	
	If Not ValueIsFilled(ThisObject.ProductsType)
		Or ThisObject.ProductsType <> EnumProductsType Then
		
		ThisObject.ProductsType = EnumProductsType;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
